interface Area {
    name: string;
    regions: string[];
  }
  
  const area: Area[] = [
      {
        name: '서울',
        regions: ['강남구', '마포구', '종로구', '용산구', '성동구','중구','송파구','서대문구','서초구','영등포구','광진구','성북구','관악구','은평구','동작구','강서구','동대문구','강동구','노원구','중랑구','강북구','구로구','양천구','금천구','동봉구'],
      },
      {
        name: '경기도',
        regions: ['수원시', '고양시', '성남시','용인시','파주시','화성시','남양주시','안산시','양평군','시흥시','김포시','가평군','평택시','의왕시','하남시','안양시','양주시','부천시','광주시','안성시','의정부시','이천시','여주시','포천시','오산시','광명시','연천군','동두천시','구리시','과천시','군포시'],
      },
      {
        name: '제주도',
        regions: ['제주시', '서귀포시'],
      },
      {
        name: '대전',
        regions: ['대덕구', '동구', '서구', '유성구', '중구'],
      },
      {
        name: '부산',
        regions: ['부산진구','해운대구','수영구','기장군','영도구','중구','동래구','남구', '동구','북구','강서구','금정구','연제구','사하구', '서구','사상구'],
      },
      {
        name: '강원도',
        regions: ['강릉시', '춘천시', '속초시', '양양군', '고성군', '원주시', '동해시', '삼척시', '홍천군', '평창군', '인제군', '정선군', '영월군', '횡성군', '태백시', '철원군'],
      },
      {
        name: '대구',
        regions: ['중구', '수성구', '동구', '남구','북구','달서구','달성군','서구'],
      },
      {
        name: '경상북도',
        regions: ['경주시','포항시','경산시','울릉군','안동시','청도군','구미시','문경시','영주시','칠곡군','상주시','봉화군','울진군','군위군','영덕군','성주군','예천군','청송군','영천시','영양군'],
      },
      {
        name: '충청남도',
        regions: ['천안시','아산시','공주시','서산시','예산군','태안군','당진시','보령시','부여군','논산시','홍성군','금산군','서천군','청양군'],
      },
      {
        name: '대전',
        regions: ['서구', '유성구', '중구', '동구', '대덕구', '관저2동'],
      },
      {
        name: '경상남도',
        regions: ['창원시','거제시','김해시','남해군','진주시','통영시','하동군','밀양시','함안군','양산시','창녕군','사천시','함양군','합천군','고성군','산청군','거창군'],
      },
      {
        name: '인천',
        regions: ['중구','남동구','연수구','서구','강화군','부평구','옹진군','계양구','미추홀구','동구'],
      },
      {
        name: '전라남도',
        regions: ['여수시','담양군','목포시','순천시','구례군','강진군','나주시','신안군','화순군','해남군','장성군','광양시','보성군','완도군','무안군','고흥군','곡성군','진도군','장흥군','영광군'],
      },
      {
        name: '광주',
        regions: ['동구','북구','광산구','남구','서구'],
      },
      {
        name: '충청북도',
        regions: ['청주시','제천시','충주시','진천군','단양군','괴산군','옥천군','증평군','보은군','영동군'],
      },
      {
        name: '전라북도',
        regions: ['전주시','군산시','익산시','무주군','완주군','부안군','정읍시','고창군','남원시','김제시','임실군','진안군'],
      },
      {
        name: '울산',
        regions: ['남구','울주군','중구','동구','북구'],
      },
      {
        name: '세종',
        regions: ['새롬동','금남면','조치원읍','세종동','고운동','도담동','반곡동','종촌동','장군면','연서면','한솔동','보람동','집현동','연기면','대평동'],
      },
    ];
  
  export default area;